# Controlled Application Shared Components Location Property

Source: https://www.revitapidocs.com/2026/bae12f81-ed1f-a0df-3954-c219fa835ae4.htm

---

| Controlled Application Shared Components Location Property |
| --- |

Location of shared components used by Revit.
**Namespace:** Autodesk.Revit.ApplicationServices
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public string SharedComponentsLocation { get; }
```

```
Public ReadOnly Property SharedComponentsLocation As String
	Get
```

```
public:
property String^ SharedComponentsLocation {
	String^ get ();
}
```

```
member SharedComponentsLocation : string with get
```

#### Property Value

String See Also

#### Reference

ControlledApplication Class Autodesk.Revit.ApplicationServices Namespace